NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_config_server.c
static access_model_handle_t m_access_model_subscriptions_get_model_handle;
static dsm_handle_t * mp_access_model_subscriptions_get_handle_array;
static uint16_t m_access_model_subscriptions_get_handle_count;
static uint32_t m_access_model_subscriptions_get_retval;

static access_model_handle_t m_access_model_applications_get_model_handle;
static dsm_handle_t * mp_access_model_applications_get_appkey_array;
static uint16_t m_access_model_applications_get_appkey_count;
static uint32_t m_access_model_applications_get_retval;

static nrf_mesh_evt_handler_t *mp_mesh_evt_handler;

MOCK_QUEUE_DEF(config_server_evt_mock, config_server_evt_t, NULL);

/*********** Helper functions ***********/

static void send_message(uint16_t opcode, const uint8_t * p_data, uint16_t length)
{
    access_message_rx_t message = {};
    message.opcode.opcode = opcode;
    message.opcode.company_id = ACCESS_COMPANY_ID_NONE;
    message.p_data = p_data;
    message.length = length;
    /* The configuration server doesn't care about the message metadata,
     * so those fields are left as 0.                                    */

    bool opcode_found = false;
    for (uint32_t i = 0; i < m_num_opcodes; ++i)
    {
        if (mp_opcode_handlers[i].opcode.opcode == opcode)
        {
            opcode_found = true;
            mp_opcode_handlers[i].handler(m_server_handle, &message, NULL);
            break;
        }
    }

    TEST_ASSERT_TRUE_MESSAGE(opcode_found, "an opcode was not found!");
}

/*********** Additional mock functions ***********/
static uint32_t access_model_add_mock(const access_model_add_params_t * p_init_params,
        access_model_handle_t * p_model_handle, int count)
{
    m_server_handle = 0;
    *p_model_handle = m_server_handle;

    mp_opcode_handlers = p_init_params->p_opcode_handlers;
    m_num_opcodes = p_init_params->opcode_count;

    TEST_ASSERT_EQUAL(CONFIG_SERVER_MODEL_ID, p_init_params->model_id.model_id);
    TEST_ASSERT_EQUAL(ACCESS_COMPANY_ID_NONE, p_init_params->model_id.company_id);
    TEST_ASSERT_EQUAL(0, p_init_params->element_index);

    return NRF_SUCCESS;
}

static uint32_t access_model_reply_mock(access_model_handle_t handle, const access_message_rx_t * p_message,
                                        const access_message_tx_t * p_reply, int count)
{
    TEST_ASSERT_EQUAL(m_server_handle, handle);

    if (mp_previous_reply_buffer != NULL)
    {
        free(mp_previous_reply_buffer);
    }

    mp_previous_reply_buffer = malloc(p_reply->length);
    TEST_ASSERT_NOT_NULL(mp_previous_reply_buffer);
    if (p_reply->p_buffer)
    {
        memcpy(mp_previous_reply_buffer, p_reply->p_buffer, p_reply->length);
    }

    m_previous_reply.opcode = p_reply->opcode;
    m_previous_reply.p_buffer = mp_previous_reply_buffer;
    m_previous_reply.length = p_reply->length;
    m_previous_reply.force_segmented = false;
    m_previous_reply.transmic_size = NRF_MESH_TRANSMIC_SIZE_DEFAULT;

    m_previous_reply_received = true;
    return NRF_SUCCESS;
}

static uint32_t access_model_subscriptions_get_mock(access_model_handle_t handle,
                                                    dsm_handle_t * p_address_handles, uint16_t * p_count, int calls)
{
    TEST_ASSERT_EQUAL(m_access_model_subscriptions_get_model_handle, handle);

    memcpy(p_address_handles, mp_access_model_subscriptions_get_handle_array,
           m_access_model_subscriptions_get_handle_count * sizeof(dsm_handle_t));
    *p_count = m_access_model_subscriptions_get_handle_count;
    return m_access_model_subscriptions_get_retval;
}

static uint32_t access_model_applications_get_mock(access_model_handle_t handle,
                                                   dsm_handle_t * p_appkey_handles, uint16_t * p_count, int calls)
{
    TEST_ASSERT_EQUAL(m_access_model_applications_get_model_handle, handle);

    memcpy(p_appkey_handles, mp_access_model_applications_get_appkey_array,
           m_access_model_applications_get_appkey_count * sizeof(dsm_handle_t));
    *p_count = m_access_model_applications_get_appkey_count;
    return m_access_model_applications_get_retval;
}

static uint32_t dsm_subnet_get_all_mock(mesh_key_index_t * p_netkey_indexes, uint32_t * p_count, int count)
{
    memcpy(p_netkey_indexes, mp_dsm_subnet_get_all_index_array, m_dsm_subnet_get_all_index_count * sizeof(mesh_key_index_t));
    *p_count = m_dsm_subnet_get_all_index_count;
    return m_dsm_subnet_get_all_retval;
}

static uint32_t dsm_appkey_get_all_mock(dsm_handle_t subnet_handle, mesh_key_index_t * p_appkey_indexes, uint32_t * p_count, int count)
{
    TEST_ASSERT_EQUAL(m_dsm_appkey_get_all_subnet, subnet_handle);
    memcpy(p_appkey_indexes, mp_dsm_appkey_get_all_index_array, m_dsm_appkey_get_all_index_count * sizeof(mesh_key_index_t));
    *p_count = m_dsm_appkey_get_all_index_count;
    return m_dsm_appkey_get_all_retval;
}

static void config_server_evt_cb(const config_server_evt_t * p_evt)
{
    config_server_evt_t expected_evt;
    config_server_evt_mock_Consume(&expected_evt);

    TEST_ASSERT_EQUAL(expected_evt.type, p_evt->type);
}

static void nrf_mesh_evt_handler_add_mock(nrf_mesh_evt_handler_t * p_handler_params,
                                          int num_calls)
{
    mp_mesh_evt_handler = p_handler_params;

    nrf_mesh_evt_handler_add_StubWithCallback(NULL);
}

/*********** Test Initialization and Finalization ***********/

void setUp(void)
{
    access_mock_Init();
    access_config_mock_Init();
    composition_data_mock_Init();
    device_state_manager_mock_Init();
    heartbeat_mock_Init();
    net_beacon_mock_Init();
    mesh_opt_core_mock_Init();
    nrf_mesh_keygen_mock_Init();
    rand_mock_Init();
    nrf_mesh_events_mock_Init();
    mesh_stack_mock_Init();
    nrf_mesh_mock_Init();
    config_server_evt_mock_Init();
#if MESH_FRIEND_FEATURE_ENABLED
    friend_internal_mock_Init();
    mesh_friend_mock_Init();
#endif
    m_previous_reply_received = false;
    mp_previous_reply_buffer = NULL;

    nrf_mesh_unique_token_get_IgnoreAndReturn(UNIQUE_TOKEN);

    access_model_add_StubWithCallback(access_model_add_mock);
    access_model_reply_StubWithCallback(access_model_reply_mock);

    heartbeat_public_info_getter_register_ExpectAnyArgs();
    nrf_mesh_evt_handler_add_StubWithCallback(nrf_mesh_evt_handler_add_mock);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, config_server_init(config_server_evt_cb));
}

void tearDown(void)
{
    if (mp_previous_reply_buffer != NULL)
    {
        free(mp_previous_reply_buffer);
        mp_previous_reply_buffer = NULL;
    }

    access_mock_Verify();
    access_mock_Destroy();
    access_config_mock_Verify();
    access_config_mock_Destroy();
    composition_data_mock_Verify();
    composition_data_mock_Destroy();
    device_state_manager_mock_Verify();
    device_state_manager_mock_Destroy();
    heartbeat_mock_Verify();
    heartbeat_mock_Destroy();
    net_beacon_mock_Verify();
    net_beacon_mock_Destroy();
    mesh_opt_core_mock_Verify();
    mesh_opt_core_mock_Destroy();
    nrf_mesh_keygen_mock_Verify();
    nrf_mesh_keygen_mock_Destroy();
    rand_mock_Verify();
    rand_mock_Destroy();
    nrf_mesh_events_mock_Verify();
    nrf_mesh_events_mock_Destroy();
    mesh_stack_mock_Verify();
    mesh_stack_mock_Destroy();
    nrf_mesh_mock_Verify();
    nrf_mesh_mock_Destroy();
    config_server_evt_mock_Verify();
    config_server_evt_mock_Destroy();
#if MESH_FRIEND_FEATURE_ENABLED
    friend_internal_mock_Verify();
    friend_internal_mock_Destroy();
    mesh_friend_mock_Verify();
    mesh_friend_mock_Destroy();
#endif
}

/*********** Test Cases ***********/

void test_config_beacon_get(void)
{
    send_message(CONFIG_OPCODE_BEACON_GET, NULL, 4); /* Test with invalid length */
    TEST_ASSERT_FALSE(m_previous_reply_received);

