NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_config_server.c
    const config_msg_appkey_status_t * p_reply = (const config_msg_appkey_status_t *) m_previous_reply.p_buffer;
    TEST_ASSERT_EQUAL(ACCESS_STATUS_SUCCESS, p_reply->status);

    uint16_t received_netkey, received_appkey;
    config_msg_key_index_24_get(&p_reply->key_indexes, &received_netkey, &received_appkey);
    TEST_ASSERT_EQUAL_UINT16(netkey_index, received_netkey);
    TEST_ASSERT_EQUAL_UINT16(appkey_index, received_appkey);
}

void test_appkey_get(void)
{
    const uint16_t netkey_index = 994;

    mesh_key_index_t appkey_indexes[] = { 2, 4, 8, 7, 31, 1609, 2002 };
    uint8_t appkey_indexes_packed[] =
        {
            0x02, 0x40, 0x00, /* (2, 4) */
            0x08, 0x70, 0x00, /* (8, 7) */
            0x1f, 0x90, 0x64, /* (31, 1609) */
            0xd2, 0x07        /* (2002) */
        };

    config_msg_appkey_get_t message;
    message.netkey_index = netkey_index & CONFIG_MSG_KEY_INDEX_12_MASK;

    dsm_handle_t subnet_handle = 1021;
    dsm_net_key_index_to_subnet_handle_ExpectAndReturn(netkey_index, subnet_handle);

    int appkey_count = ARRAY_SIZE(appkey_indexes);
    DSM_APPKEY_GET_ALL_MOCK_SETUP(subnet_handle, appkey_indexes, appkey_count, NRF_SUCCESS);
    dsm_appkey_get_all_StubWithCallback(dsm_appkey_get_all_mock);

    send_message(CONFIG_OPCODE_APPKEY_GET, (const uint8_t *) &message, sizeof(config_msg_appkey_get_t));

    TEST_ASSERT_TRUE(m_previous_reply_received);
    VERIFY_REPLY_OPCODE(CONFIG_OPCODE_APPKEY_LIST);
    TEST_ASSERT_EQUAL(sizeof(config_msg_appkey_list_t) + sizeof(appkey_indexes_packed), m_previous_reply.length);

    const config_msg_appkey_list_t * p_reply = (const config_msg_appkey_list_t *) m_previous_reply.p_buffer;
    TEST_ASSERT_EQUAL(ACCESS_STATUS_SUCCESS, p_reply->status);

    uint16_t received_netkey_index = p_reply->netkey_index;
    TEST_ASSERT_EQUAL_UINT16(netkey_index, received_netkey_index);

    TEST_ASSERT_EQUAL_UINT8_ARRAY(appkey_indexes_packed, p_reply->packed_appkey_indexes, sizeof(appkey_indexes_packed));
}

void test_identity_get(void)
{
    const config_msg_identity_get_t message = { .netkey_index = 4 };

#if MESH_FEATURE_GATT_PROXY_ENABLED
    dsm_net_key_index_to_subnet_handle_ExpectAndReturn(message.netkey_index, 0);
    dsm_beacon_info_get_ExpectAnyArgsAndReturn(NRF_SUCCESS);
    proxy_node_id_is_enabled_ExpectAnyArgsAndReturn(false);
#endif
    send_message(CONFIG_OPCODE_NODE_IDENTITY_GET, (const uint8_t *) &message, sizeof(message));

    TEST_ASSERT_TRUE(m_previous_reply_received);
    VERIFY_REPLY_OPCODE(CONFIG_OPCODE_NODE_IDENTITY_STATUS);
    TEST_ASSERT_EQUAL(sizeof(config_msg_identity_status_t), m_previous_reply.length);

    const config_msg_identity_status_t * p_reply = (const config_msg_identity_status_t *) m_previous_reply.p_buffer;

    TEST_ASSERT_EQUAL(ACCESS_STATUS_SUCCESS, p_reply->status);
    TEST_ASSERT_EQUAL(message.netkey_index, p_reply->netkey_index);
#if MESH_FEATURE_GATT_PROXY_ENABLED
    TEST_ASSERT_EQUAL(CONFIG_IDENTITY_STATE_STOPPED, p_reply->identity_state);
#else
    TEST_ASSERT_EQUAL(CONFIG_IDENTITY_STATE_UNSUPPORTED, p_reply->identity_state);
#endif
}

void test_identity_set(void)
{
    const config_msg_identity_set_t message =
        {
            .netkey_index = 5,
            .identity_state = CONFIG_IDENTITY_STATE_RUNNING
        };

#if MESH_FEATURE_GATT_PROXY_ENABLED
    nrf_mesh_beacon_info_t beacon_info;
    const nrf_mesh_beacon_info_t * p_beacon_info = &beacon_info;
    nrf_mesh_key_refresh_phase_t phase = NRF_MESH_KEY_REFRESH_PHASE_1;
    dsm_net_key_index_to_subnet_handle_ExpectAndReturn(message.netkey_index, 4);
    dsm_beacon_info_get_ExpectAndReturn(4, NULL, NRF_SUCCESS);
    dsm_beacon_info_get_IgnoreArg_pp_beacon_info();
    dsm_beacon_info_get_ReturnThruPtr_pp_beacon_info(&p_beacon_info);
    dsm_subnet_kr_phase_get_ExpectAndReturn(4, NULL, NRF_SUCCESS);
    dsm_subnet_kr_phase_get_IgnoreArg_p_phase();
    dsm_subnet_kr_phase_get_ReturnThruPtr_p_phase(&phase);
    proxy_is_enabled_ExpectAndReturn(true);
    proxy_node_id_enable_ExpectAndReturn(p_beacon_info, phase, NRF_SUCCESS);
    proxy_node_id_is_enabled_ExpectAndReturn(p_beacon_info, NRF_SUCCESS);
#endif
    send_message(CONFIG_OPCODE_NODE_IDENTITY_SET, (const uint8_t *) &message, sizeof(message));

    TEST_ASSERT_TRUE(m_previous_reply_received);
    VERIFY_REPLY_OPCODE(CONFIG_OPCODE_NODE_IDENTITY_STATUS);
    TEST_ASSERT_EQUAL(sizeof(config_msg_identity_status_t), m_previous_reply.length);

    const config_msg_identity_status_t * p_reply = (const config_msg_identity_status_t *) m_previous_reply.p_buffer;

    TEST_ASSERT_EQUAL(ACCESS_STATUS_SUCCESS, p_reply->status);
    TEST_ASSERT_EQUAL(message.netkey_index, p_reply->netkey_index);
#if MESH_FEATURE_GATT_PROXY_ENABLED
    TEST_ASSERT_EQUAL(CONFIG_IDENTITY_STATE_STOPPED, p_reply->identity_state);
#else
    TEST_ASSERT_EQUAL(CONFIG_IDENTITY_STATE_UNSUPPORTED, p_reply->identity_state);
#endif
}

/* Test invalid parameters */
void test_node_id_set_invalid_params(void)
{
#if MESH_FEATURE_GATT_PROXY_ENABLED
    const config_msg_identity_set_t message =
    {
        .netkey_index = 5,
        .identity_state = CONFIG_IDENTITY_STATE_RUNNING
    };

    proxy_node_id_is_enabled_IgnoreAndReturn(NRF_SUCCESS);

    m_previous_reply_received = false;
    dsm_net_key_index_to_subnet_handle_ExpectAndReturn(message.netkey_index, 4);
    dsm_beacon_info_get_ExpectAnyArgsAndReturn(NRF_ERROR_NOT_FOUND);

    send_message(CONFIG_OPCODE_NODE_IDENTITY_SET, (const uint8_t *) &message, sizeof(message));
    TEST_ASSERT_TRUE(m_previous_reply_received);
    VERIFY_REPLY_OPCODE(CONFIG_OPCODE_NODE_IDENTITY_STATUS);
    TEST_ASSERT_EQUAL(ACCESS_STATUS_INVALID_NETKEY, ((config_msg_identity_status_t *) m_previous_reply.p_buffer)->status);

    m_previous_reply_received = false;
    dsm_net_key_index_to_subnet_handle_ExpectAndReturn(message.netkey_index, 4);
    dsm_beacon_info_get_ExpectAnyArgsAndReturn(NRF_SUCCESS);
    dsm_subnet_kr_phase_get_ExpectAnyArgsAndReturn(NRF_ERROR_NOT_FOUND);

    send_message(CONFIG_OPCODE_NODE_IDENTITY_SET, (const uint8_t *) &message, sizeof(message));
    TEST_ASSERT_TRUE(m_previous_reply_received);
    VERIFY_REPLY_OPCODE(CONFIG_OPCODE_NODE_IDENTITY_STATUS);
    TEST_ASSERT_EQUAL(ACCESS_STATUS_INVALID_NETKEY, ((config_msg_identity_status_t *) m_previous_reply.p_buffer)->status);

    m_previous_reply_received = false;
    dsm_net_key_index_to_subnet_handle_ExpectAndReturn(message.netkey_index, 4);
    dsm_beacon_info_get_ExpectAnyArgsAndReturn(NRF_SUCCESS);
    dsm_subnet_kr_phase_get_ExpectAnyArgsAndReturn(NRF_SUCCESS);
    proxy_is_enabled_ExpectAndReturn(false);

    send_message(CONFIG_OPCODE_NODE_IDENTITY_SET, (const uint8_t *) &message, sizeof(message));
    TEST_ASSERT_TRUE(m_previous_reply_received);
    VERIFY_REPLY_OPCODE(CONFIG_OPCODE_NODE_IDENTITY_STATUS);
    TEST_ASSERT_EQUAL(ACCESS_STATUS_TEMPORARILY_UNABLE_TO_CHANGE_STATE, ((config_msg_identity_status_t *) m_previous_reply.p_buffer)->status);

    m_previous_reply_received = false;
    dsm_net_key_index_to_subnet_handle_ExpectAndReturn(message.netkey_index, 4);
    dsm_beacon_info_get_ExpectAnyArgsAndReturn(NRF_SUCCESS);
    dsm_subnet_kr_phase_get_ExpectAnyArgsAndReturn(NRF_SUCCESS);
    proxy_is_enabled_ExpectAndReturn(true);
    proxy_node_id_enable_ExpectAnyArgsAndReturn(NRF_ERROR_BUSY);

    send_message(CONFIG_OPCODE_NODE_IDENTITY_SET, (const uint8_t *) &message, sizeof(message));
    TEST_ASSERT_TRUE(m_previous_reply_received);
    VERIFY_REPLY_OPCODE(CONFIG_OPCODE_NODE_IDENTITY_STATUS);
    TEST_ASSERT_EQUAL(ACCESS_STATUS_TEMPORARILY_UNABLE_TO_CHANGE_STATE, ((config_msg_identity_status_t *) m_previous_reply.p_buffer)->status);
#endif
}

