NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_config_server.c
void test_model_app_bind_unbind(void)
{
    config_server_evt_t evt;

    const config_msg_app_bind_unbind_t messages[2] =
    {
        {
            .element_address = 0x4321,
            .appkey_index = 4,
            .model_id.sig.model_id = 0x1453
        },
        {
            .element_address = 0x1234,
            .appkey_index = 5,
            .model_id.vendor.model_id = 0x6651,
            .model_id.vendor.company_id = 0x4449
        }
    };

    /* This loop runs 4 times, the first two testing the Model App Bind message, and the last two testing the
     * Model App Unbind message.
     */
    for (int i = 0; i < 4; ++i)
    {
        bool sig_model = !(i % 2);

        uint16_t element_index = 44;
        EXPECT_DSM_LOCAL_UNICAST_ADDRESSES_GET(messages[i % 2].element_address, element_index);

        access_model_handle_t model_handle = 77;
        access_handle_get_ExpectAnyArgsAndReturn(NRF_SUCCESS);
        access_handle_get_ReturnThruPtr_p_handle(&model_handle);

        dsm_handle_t appkey_handle = 15;
        dsm_appkey_index_to_appkey_handle_ExpectAndReturn(messages[i % 2].appkey_index, appkey_handle);
        access_flash_config_store_Expect();

        if (i < 2)
        {
            evt.type = CONFIG_SERVER_EVT_MODEL_APP_BIND;
            config_server_evt_mock_Expect(&evt);

            access_model_application_bind_ExpectAndReturn(model_handle, appkey_handle, NRF_SUCCESS);
            send_message(CONFIG_OPCODE_MODEL_APP_BIND, (const uint8_t *) &messages[i % 2], sizeof(messages[i % 2]) - sig_model * sizeof(uint16_t));
        }
        else
        {
            evt.type = CONFIG_SERVER_EVT_MODEL_APP_UNBIND;
            config_server_evt_mock_Expect(&evt);

            access_model_application_unbind_ExpectAndReturn(model_handle, appkey_handle, NRF_SUCCESS);

            access_model_publish_application_get_ExpectAnyArgsAndReturn(NRF_SUCCESS);
            access_model_publish_application_get_ReturnThruPtr_p_appkey_handle(&appkey_handle);
            access_model_publication_stop_ExpectAndReturn(model_handle, NRF_SUCCESS);

            send_message(CONFIG_OPCODE_MODEL_APP_UNBIND, (const uint8_t *) &messages[i % 2], sizeof(messages[i % 2]) - sig_model * sizeof(uint16_t));
        }

        TEST_ASSERT_TRUE(m_previous_reply_received);
        VERIFY_REPLY_OPCODE(CONFIG_OPCODE_MODEL_APP_STATUS);
        TEST_ASSERT_EQUAL(sizeof(config_msg_app_status_t) - sig_model * sizeof(uint16_t), m_previous_reply.length);

        const config_msg_app_status_t * p_reply = (const config_msg_app_status_t *) m_previous_reply.p_buffer;
        TEST_ASSERT_EQUAL(ACCESS_STATUS_SUCCESS, p_reply->status);

        TEST_ASSERT_EQUAL(messages[i % 2].element_address, p_reply->element_address);
        TEST_ASSERT_EQUAL(messages[i % 2].appkey_index, p_reply->appkey_index);
        TEST_ASSERT_EQUAL_MEMORY(&messages[i % 2].model_id, &p_reply->model_id, sizeof(config_model_id_t) - sig_model * sizeof(uint16_t));
    }
}

void test_friend_get(void)
{
#if MESH_FEATURE_FRIEND_ENABLED
    mesh_friend_is_enabled_ExpectAndReturn(true);
#endif
    send_message(CONFIG_OPCODE_FRIEND_GET, NULL, 0); /* Message with no parameters */

    TEST_ASSERT_TRUE(m_previous_reply_received);
    VERIFY_REPLY_OPCODE(CONFIG_OPCODE_FRIEND_STATUS);

    TEST_ASSERT_NOT_NULL(mp_previous_reply_buffer);
    TEST_ASSERT_EQUAL(sizeof(config_msg_friend_status_t), m_previous_reply.length);
#if MESH_FEATURE_FRIEND_ENABLED
    TEST_ASSERT_EQUAL_UINT8(CONFIG_FRIEND_STATE_SUPPORTED_ENABLED, m_previous_reply.p_buffer[0]);
#else
    TEST_ASSERT_EQUAL_UINT8(CONFIG_FRIEND_STATE_UNSUPPORTED, m_previous_reply.p_buffer[0]);
#endif
}

void test_friend_set(void)
{
    const config_msg_friend_set_t message = { .friend_state = CONFIG_FRIEND_STATE_SUPPORTED_ENABLED };
#if MESH_FEATURE_FRIEND_ENABLED
    mesh_friend_enable_Expect();
    mesh_friend_is_enabled_ExpectAndReturn(true);
#endif
    send_message(CONFIG_OPCODE_FRIEND_SET, (const uint8_t *) &message, sizeof(message));

    TEST_ASSERT_TRUE(m_previous_reply_received);
    VERIFY_REPLY_OPCODE(CONFIG_OPCODE_FRIEND_STATUS);

    TEST_ASSERT_NOT_NULL(mp_previous_reply_buffer);
    TEST_ASSERT_EQUAL(sizeof(config_msg_friend_status_t), m_previous_reply.length);
#if MESH_FEATURE_FRIEND_ENABLED
    TEST_ASSERT_EQUAL_UINT8(CONFIG_FRIEND_STATE_SUPPORTED_ENABLED, m_previous_reply.p_buffer[0]);
#else
    TEST_ASSERT_EQUAL_UINT8(CONFIG_FRIEND_STATE_UNSUPPORTED, m_previous_reply.p_buffer[0]);
#endif
}

void test_key_refresh_phase_get(void)
{
    send_message(CONFIG_OPCODE_KEY_REFRESH_PHASE_GET, NULL, 42); /* Invalid length */
    TEST_ASSERT_FALSE(m_previous_reply_received);

    nrf_mesh_key_refresh_phase_t expected_phases[] =
        { NRF_MESH_KEY_REFRESH_PHASE_0, NRF_MESH_KEY_REFRESH_PHASE_1, NRF_MESH_KEY_REFRESH_PHASE_2 };
    for (uint32_t i = 0; i < 3; ++i)
    {
        dsm_net_key_index_to_subnet_handle_ExpectAndReturn(4, 2);
        dsm_subnet_kr_phase_get_ExpectAndReturn(2, NULL, NRF_SUCCESS);
        dsm_subnet_kr_phase_get_IgnoreArg_p_phase();
        dsm_subnet_kr_phase_get_ReturnThruPtr_p_phase(&expected_phases[i]);

        config_msg_key_refresh_phase_get_t message = { .netkey_index = 4 };
        send_message(CONFIG_OPCODE_KEY_REFRESH_PHASE_GET, (const uint8_t *) &message, sizeof(message));
        TEST_ASSERT_TRUE(m_previous_reply_received);

        TEST_ASSERT_NOT_NULL(mp_previous_reply_buffer);
        VERIFY_REPLY_OPCODE(CONFIG_OPCODE_KEY_REFRESH_PHASE_STATUS);
        TEST_ASSERT_EQUAL(sizeof(config_msg_key_refresh_phase_status_t), m_previous_reply.length);

        const config_msg_key_refresh_phase_status_t * p_reply = (const config_msg_key_refresh_phase_status_t *) m_previous_reply.p_buffer;
        TEST_ASSERT_EQUAL(ACCESS_STATUS_SUCCESS, p_reply->status);
        TEST_ASSERT_EQUAL(4, p_reply->netkey_index);
        TEST_ASSERT_EQUAL((uint8_t) expected_phases[i], p_reply->phase);
    }
}

void test_key_refresh_phase_set(void)
{
    config_server_evt_t evt;
    evt.type = CONFIG_SERVER_EVT_KEY_REFRESH_PHASE_SET;

    send_message(CONFIG_OPCODE_KEY_REFRESH_PHASE_SET, NULL, 31); /* Invalid length */
    TEST_ASSERT_FALSE(m_previous_reply_received);

    const config_msg_key_index_12_t netkey_index = 22;
    const dsm_handle_t netkey_handle = 11;
    access_status_t reply_status = ACCESS_STATUS_UNSPECIFIED_ERROR;
    nrf_mesh_key_refresh_phase_t reply_phase = NRF_MESH_KEY_REFRESH_PHASE_0;

    for (uint8_t initial_phase = 0; initial_phase < 3; initial_phase++)
    {
        for (uint8_t transition = 0; transition < 4; transition++)
        {
            bool is_replayed = false;
            m_previous_reply_received = false;

            dsm_net_key_index_to_subnet_handle_ExpectAndReturn(netkey_index, netkey_handle);

            dsm_subnet_kr_phase_get_ExpectAndReturn(netkey_handle, NULL, NRF_SUCCESS);
            dsm_subnet_kr_phase_get_IgnoreArg_p_phase();
            dsm_subnet_kr_phase_get_ReturnThruPtr_p_phase((nrf_mesh_key_refresh_phase_t *) &initial_phase);

            switch (transition)
            {
                case 2:
                    if (initial_phase == NRF_MESH_KEY_REFRESH_PHASE_2 || initial_phase == NRF_MESH_KEY_REFRESH_PHASE_1)
                    {
                        if (initial_phase == NRF_MESH_KEY_REFRESH_PHASE_1)
                        {
                            dsm_subnet_update_swap_keys_ExpectAndReturn(netkey_handle, NRF_SUCCESS);
                        }
                        reply_status = ACCESS_STATUS_SUCCESS;
                        reply_phase = NRF_MESH_KEY_REFRESH_PHASE_2;
                        is_replayed = true;

