NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_config_server.c
                    }
                    break;
                case 3:
                    if (initial_phase != NRF_MESH_KEY_REFRESH_PHASE_3)
                    {
                        if (initial_phase != NRF_MESH_KEY_REFRESH_PHASE_0)
                        {
                            dsm_subnet_update_commit_ExpectAndReturn(netkey_handle, NRF_SUCCESS);
                        }
                        reply_status = ACCESS_STATUS_SUCCESS;
                        reply_phase = NRF_MESH_KEY_REFRESH_PHASE_0;
                        is_replayed = true;
                    }
                    break;
            }

            if (is_replayed)
            {
                config_server_evt_mock_Expect(&evt);
            }

            const config_msg_key_refresh_phase_set_t message = { netkey_index, transition };
            send_message(CONFIG_OPCODE_KEY_REFRESH_PHASE_SET, (const uint8_t *) &message, sizeof(message));

            if (is_replayed)
            {
                TEST_ASSERT_TRUE(m_previous_reply_received);
                TEST_ASSERT_NOT_NULL(mp_previous_reply_buffer);
                VERIFY_REPLY_OPCODE(CONFIG_OPCODE_KEY_REFRESH_PHASE_STATUS);

                const config_msg_key_refresh_phase_status_t * p_reply = (const config_msg_key_refresh_phase_status_t *) m_previous_reply.p_buffer;
                TEST_ASSERT_EQUAL(reply_status, p_reply->status);
                TEST_ASSERT_EQUAL(reply_phase, p_reply->phase);
                TEST_ASSERT_EQUAL(netkey_index, p_reply->netkey_index);
            }
            else
            {
                TEST_ASSERT_FALSE(m_previous_reply_received);
            }
        }
    }
}

void test_subscription_add(void)
{
    config_server_evt_t evt;
    evt.type = CONFIG_SERVER_EVT_MODEL_SUBSCRIPTION_ADD;

    const config_msg_subscription_add_del_owr_t messages[2] =
    {
        {
            .element_address = 0x1234,
            .address = 0xc345,
            .model_id.sig.model_id = 0x4211,
        },
        {
            .element_address = 0x4321,
            .address = 0xc432,
            .model_id.vendor.model_id = 0x1289,
            .model_id.vendor.company_id = 0x9922
        }
    };

    for (int i = 0; i < 2; ++i)
    {
        bool sig_model = !i;

        uint16_t element_index = 63;
        EXPECT_DSM_LOCAL_UNICAST_ADDRESSES_GET(messages[i].element_address, element_index);

        access_model_handle_t model_handle = 0x9962;

        access_handle_get_ExpectAnyArgsAndReturn(NRF_SUCCESS);
        access_handle_get_ReturnThruPtr_p_handle(&model_handle);

        dsm_handle_t address_handle = 83;
        dsm_address_subscription_add_ExpectAndReturn(messages[i].address, NULL, NRF_SUCCESS);
        dsm_address_subscription_add_IgnoreArg_p_address_handle();
        dsm_address_subscription_add_ReturnThruPtr_p_address_handle(&address_handle);

        access_model_subscription_add_ExpectAndReturn(model_handle, address_handle, NRF_SUCCESS);
        access_flash_config_store_Expect();

        config_server_evt_mock_Expect(&evt);

        m_previous_reply_received = false;
        send_message(CONFIG_OPCODE_MODEL_SUBSCRIPTION_ADD, (const uint8_t *) &messages[i], sizeof(messages[i]) - sig_model * sizeof(uint16_t));

        TEST_ASSERT_TRUE(m_previous_reply_received);
        VERIFY_REPLY_OPCODE(CONFIG_OPCODE_MODEL_SUBSCRIPTION_STATUS);
        TEST_ASSERT_EQUAL(sizeof(config_msg_subscription_status_t) - sig_model * sizeof(uint16_t), m_previous_reply.length);

        const config_msg_subscription_status_t * p_reply = (const config_msg_subscription_status_t *) m_previous_reply.p_buffer;
        TEST_ASSERT_EQUAL(ACCESS_STATUS_SUCCESS, p_reply->status);
        TEST_ASSERT_EQUAL(messages[i].element_address, p_reply->element_address);
        TEST_ASSERT_EQUAL(messages[i].address, p_reply->address);

        TEST_ASSERT_EQUAL_MEMORY(&messages[i].model_id, &p_reply->model_id, sizeof(config_model_id_t) - sig_model * sizeof(uint16_t));
    }
}

void test_reject_all_nodes_addr_subscription_add(void)
{
    const config_msg_subscription_add_del_owr_t messages[1] =
    {
        {
            .element_address = 0x1234,
            .address = NRF_MESH_ALL_NODES_ADDR,
            .model_id.sig.model_id = 0x4211,
        }
    };

    for (int i = 0; i < 1; ++i)
    {
        bool sig_model = !i;

        uint16_t element_index = 75;
        EXPECT_DSM_LOCAL_UNICAST_ADDRESSES_GET(messages[i].element_address, element_index);

        m_previous_reply_received = false;
        send_message(CONFIG_OPCODE_MODEL_SUBSCRIPTION_ADD, (const uint8_t *) &messages[i], sizeof(messages[i]) - sig_model * sizeof(uint16_t));

        TEST_ASSERT_TRUE(m_previous_reply_received);
        VERIFY_REPLY_OPCODE(CONFIG_OPCODE_MODEL_SUBSCRIPTION_STATUS);
        TEST_ASSERT_EQUAL(sizeof(config_msg_subscription_status_t) - sig_model * sizeof(uint16_t), m_previous_reply.length);

        const config_msg_subscription_status_t * p_reply = (const config_msg_subscription_status_t *) m_previous_reply.p_buffer;
        TEST_ASSERT_EQUAL(ACCESS_STATUS_INVALID_ADDRESS, p_reply->status);
        TEST_ASSERT_EQUAL(messages[i].element_address, p_reply->element_address);
        TEST_ASSERT_EQUAL(messages[i].address, p_reply->address);

        TEST_ASSERT_EQUAL_MEMORY(&messages[i].model_id, &p_reply->model_id, sizeof(config_model_id_t) - sig_model * sizeof(uint16_t));
    }
}

void test_subscription_delete(void)
{
    config_server_evt_t evt;
    evt.type = CONFIG_SERVER_EVT_MODEL_SUBSCRIPTION_DELETE;

    const config_msg_subscription_add_del_owr_t messages[2] =
    {
        {
            .element_address = 0x1234,
            .address = 0xc345,
            .model_id.sig.model_id = 0x4211,
        },
        {
            .element_address = 0x4321,
            .address = 0xc432,
            .model_id.vendor.model_id = 0x1289,
            .model_id.vendor.company_id = 0x9922
        }
    };

    for (int i = 0; i < 2; ++i)
    {
        bool sig_model = !i;

        uint16_t element_index = 15;
        EXPECT_DSM_LOCAL_UNICAST_ADDRESSES_GET(messages[i].element_address, element_index);

