NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_config_server.c
    uint16_t element_index = 8;
    EXPECT_DSM_LOCAL_UNICAST_ADDRESSES_GET(message.element_address, element_index);

    access_model_handle_t model_handle = 0x9ffc;
    access_model_id_t model_id =
        {
            .model_id = message.model_id.vendor.model_id,
            .company_id = message.model_id.vendor.company_id
        };
    access_handle_get_ExpectAndReturn(element_index, model_id, NULL, NRF_SUCCESS);
    access_handle_get_IgnoreArg_p_handle();
    access_handle_get_ReturnThruPtr_p_handle(&model_handle);

    dsm_handle_t appkey_handles[] = { 1, 2, 3, 4, 5 };
    uint16_t appkey_handle_count = ARRAY_SIZE(appkey_handles);
    access_model_applications_get_StubWithCallback(access_model_applications_get_mock);
    ACCESS_MODEL_APPLICATIONS_GET_MOCK_SETUP(model_handle, appkey_handles, appkey_handle_count, NRF_SUCCESS);

    mesh_key_index_t appkey_indexes[] = { 11, 12, 13, 14, 15 };
    for (uint16_t i = 0; i < appkey_handle_count; ++i)
    {
        dsm_appkey_handle_to_appkey_index_ExpectAndReturn(appkey_handles[i], NULL, NRF_SUCCESS);
        dsm_appkey_handle_to_appkey_index_IgnoreArg_p_index();
        dsm_appkey_handle_to_appkey_index_ReturnThruPtr_p_index(&appkey_indexes[i]);
    }

    send_message(CONFIG_OPCODE_VENDOR_MODEL_APP_GET, (const uint8_t *) &message, sizeof(message));

    TEST_ASSERT_TRUE(m_previous_reply_received);
    VERIFY_REPLY_OPCODE(CONFIG_OPCODE_VENDOR_MODEL_APP_LIST);
    TEST_ASSERT_EQUAL(sizeof(config_msg_vendor_model_app_list_t) + 8 /* 5 x 12-bit packed key index = 8 byte */, m_previous_reply.length);

    const config_msg_vendor_model_app_list_t * p_reply = (const config_msg_vendor_model_app_list_t *) m_previous_reply.p_buffer;

    TEST_ASSERT_EQUAL(ACCESS_STATUS_SUCCESS, p_reply->status);
    TEST_ASSERT_EQUAL(message.element_address, p_reply->element_address);
    TEST_ASSERT_EQUAL(message.model_id.vendor.model_id, p_reply->vendor_model_id);
    TEST_ASSERT_EQUAL(message.model_id.vendor.company_id, p_reply->vendor_company_id);

    const uint8_t appkey_indexes_packed[] = {
        0x0b, 0xc0, 0x00, /* (11, 12) */
        0x0d, 0xe0, 0x00, /* (13, 14) */
        0x0f, 0x00        /* (15,   ) */
    };
    TEST_ASSERT_EQUAL_MEMORY(appkey_indexes_packed, p_reply->key_indexes, sizeof(appkey_indexes_packed));
}

void test_network_transmit_set(void)
{
    config_server_evt_t evt;
    evt.type = CONFIG_SERVER_EVT_NETWORK_TRANSMIT_SET;

    const uint8_t TRANSMIT_COUNT = 2;
    const uint8_t INTERVAL_STEPS = 3;
    const uint32_t INTERVAL_MS = 10 * (INTERVAL_STEPS + 1);

    const config_msg_network_transmit_set_t message =
        {
            .network_transmit_count = TRANSMIT_COUNT,
            .network_transmit_interval_steps = INTERVAL_STEPS
        };

    mesh_opt_core_adv_t net_state = {.enabled = true,
                                     .tx_count = TRANSMIT_COUNT + 1,
                                     .tx_interval_ms = INTERVAL_MS};
    mesh_opt_core_adv_set_ExpectWithArrayAndReturn(CORE_TX_ROLE_ORIGINATOR, &net_state, 1, NRF_SUCCESS);

    /* The server reads out the expected state back again when replying. */
    mesh_opt_core_adv_get_ExpectAndReturn(CORE_TX_ROLE_ORIGINATOR, NULL, NRF_SUCCESS);
    mesh_opt_core_adv_get_IgnoreArg_p_entry();
    mesh_opt_core_adv_get_ReturnThruPtr_p_entry(&net_state);

    config_server_evt_mock_Expect(&evt);

    send_message(CONFIG_OPCODE_NETWORK_TRANSMIT_SET, (const uint8_t *) &message, sizeof(message));
    TEST_ASSERT_TRUE(m_previous_reply_received);
    VERIFY_REPLY_OPCODE(CONFIG_OPCODE_NETWORK_TRANSMIT_STATUS);
    TEST_ASSERT_EQUAL(sizeof(config_msg_network_transmit_status_t), m_previous_reply.length);

    const config_msg_network_transmit_status_t * p_reply =
        (const config_msg_network_transmit_status_t *) m_previous_reply.p_buffer;
    TEST_ASSERT_EQUAL(message.network_transmit_count, p_reply->network_transmit_count);
    TEST_ASSERT_EQUAL(message.network_transmit_interval_steps, p_reply->network_transmit_interval_steps);
}

void test_network_transmit_get(void)
{
    const uint8_t TRANSMIT_COUNT = 2;
    const uint8_t INTERVAL_STEPS = 3;
    /* 10 ms * (steps + 1) according to Mesh Profile spec. 4.2.19.2. */
    const uint32_t INTERVAL_MS = 10 * (INTERVAL_STEPS + 1);

    mesh_opt_core_adv_t net_state = {.enabled = true,
                                     .tx_count = TRANSMIT_COUNT + 1,
                                     .tx_interval_ms = INTERVAL_MS};

    /* The server reads out the expected state back again when replying. */
    mesh_opt_core_adv_get_ExpectAndReturn(CORE_TX_ROLE_ORIGINATOR, NULL, NRF_SUCCESS);
    mesh_opt_core_adv_get_IgnoreArg_p_entry();
    mesh_opt_core_adv_get_ReturnThruPtr_p_entry(&net_state);

    send_message(CONFIG_OPCODE_NETWORK_TRANSMIT_GET, NULL, 0);
    TEST_ASSERT_TRUE(m_previous_reply_received);
    VERIFY_REPLY_OPCODE(CONFIG_OPCODE_NETWORK_TRANSMIT_STATUS);
    TEST_ASSERT_EQUAL(sizeof(config_msg_network_transmit_status_t), m_previous_reply.length);

    const config_msg_network_transmit_status_t * p_reply =
        (const config_msg_network_transmit_status_t *) m_previous_reply.p_buffer;
    TEST_ASSERT_EQUAL(TRANSMIT_COUNT, p_reply->network_transmit_count);
    TEST_ASSERT_EQUAL(INTERVAL_STEPS, p_reply->network_transmit_interval_steps);
}

void test_polltimeout_get(void)
{
    const uint16_t lpn_address[4] = {NRF_MESH_ADDR_UNASSIGNED, 0x8234, 0xC234, 0x1234};
    uint32_t poll_timeout = 0;
    config_msg_low_power_node_polltimeout_get_t message;

    /* Invalid length testing */
    message.lpn_address = lpn_address[3];
    send_message(CONFIG_OPCODE_LOW_POWER_NODE_POLLTIMEOUT_GET, (const uint8_t *) &message, sizeof(message) + 1);
    TEST_ASSERT_FALSE(m_previous_reply_received);

    for (uint32_t i = 0; i < ARRAY_SIZE(lpn_address); i++)
    {
        message.lpn_address = lpn_address[i];
#if MESH_FEATURE_FRIEND_ENABLED
        if (nrf_mesh_address_type_get(lpn_address[i]) == NRF_MESH_ADDRESS_TYPE_UNICAST)
        {
            poll_timeout = ~i;
            friend_remaining_poll_timeout_time_get_ExpectAndReturn(lpn_address[i], poll_timeout);
        }
#endif
        send_message(CONFIG_OPCODE_LOW_POWER_NODE_POLLTIMEOUT_GET, (const uint8_t *) &message, sizeof(message));

        if (nrf_mesh_address_type_get(lpn_address[i]) != NRF_MESH_ADDRESS_TYPE_UNICAST)
        {
            TEST_ASSERT_FALSE(m_previous_reply_received);
            continue;
        }

        TEST_ASSERT_TRUE(m_previous_reply_received);
        VERIFY_REPLY_OPCODE(CONFIG_OPCODE_LOW_POWER_NODE_POLLTIMEOUT_STATUS);

        TEST_ASSERT_EQUAL(sizeof(config_msg_low_power_node_polltimeout_status_t), m_previous_reply.length);

        const config_msg_low_power_node_polltimeout_status_t * p_reply =
            (const config_msg_low_power_node_polltimeout_status_t *) m_previous_reply.p_buffer;
        TEST_ASSERT_EQUAL(lpn_address[i], p_reply->lpn_address);
        TEST_ASSERT_EQUAL_HEX8_ARRAY(&poll_timeout, p_reply->polltimeout, sizeof(p_reply->polltimeout));
    }
}

void test_node_reset(void)
{
    config_server_evt_t expect_evt;
    expect_evt.type = CONFIG_SERVER_EVT_NODE_RESET;

    nrf_mesh_evt_t evt;

    send_message(CONFIG_OPCODE_NODE_RESET, NULL, 0);

    TEST_ASSERT_TRUE(m_previous_reply_received);
    VERIFY_REPLY_OPCODE(CONFIG_OPCODE_NODE_RESET_STATUS);

#if MESH_FEATURE_GATT_PROXY_ENABLED
    proxy_is_connected_ExpectAndReturn(true);
    proxy_stop_ExpectAndReturn(NRF_SUCCESS);

    /* Send TX_COMPLETE event */
    evt.type = NRF_MESH_EVT_TX_COMPLETE;
    evt.params.tx_complete.token = UNIQUE_TOKEN;
    mp_mesh_evt_handler->evt_cb(&evt);

    /* Send PROXY_STOPPED event */
    config_server_evt_mock_Expect(&expect_evt);
    mesh_stack_config_clear_Expect();
    flash_manager_is_stable_ExpectAndReturn(true);
    evt.type = NRF_MESH_EVT_PROXY_STOPPED;
    mp_mesh_evt_handler->evt_cb(&evt);
#else
    /* Send TX_COMPLETE event */
    config_server_evt_mock_Expect(&expect_evt);
    mesh_stack_config_clear_Expect();
    flash_manager_is_stable_ExpectAndReturn(true);

    evt.type = NRF_MESH_EVT_TX_COMPLETE;
    evt.params.tx_complete.token = UNIQUE_TOKEN;
    mp_mesh_evt_handler->evt_cb(&evt);
#endif
}
